# Задание 1
# number_1, number_2 = int(input("Введите первое целое число: ")), int(input("Введите второе целое число: "))
# line = input("Введите строку: ")
# float_number = float(input("Введите дробное число: "))
#
#
# print(line)
# print(number_1, number_2, sep="\n")
# print(float_number)




# Задание 2
# a_1 = 54
# a_2 = 12.2
# a_3 = True
# a_4 = "Домашнее задание"
#
# a_1 = str(a_1)
# a_2 = str(a_2)




# Задание 3
name = input("Введите имя: ")
surname = input("Введите отчество: ")
second_name = input("Введите фамилию: ")
age = int(input("Введите возраст: "))
city = input("Введите город: ")

print()
print(name, surname, second_name)
print(age)
print(city)
